app/controllers/application_controller.rb

  def home
    #@users = User.all
    @noticias = Noticia.paginate(:page => params[:page])
---
SELECT "noticias".* FROM "noticias" ORDER BY updated_at desc LIMIT 30 OFFSET 0